# Pandas Cheatsheet

## Introduction

### Importing pandas

In [1]:
import pandas as pd

### Q.1. Create a Series with following elements using a list

In [4]:
s1 = pd.Series([10, 20, 30, 40])
s1

0    10
1    20
2    30
3    40
dtype: int64

In [6]:
s2 = pd.Series([10, 20, 30, 40], index = ['a','b','c','d'])
s2

a    10
b    20
c    30
d    40
dtype: int64

### Q.2. Create a Series with following elements using a dictionary

In [7]:
s3 = pd.Series({'a':10,'b':20,'c':30,'d':40})
s3

a    10
b    20
c    30
d    40
dtype: int64

### Q.3. Create a Series using a scalar

In [8]:
s4 = pd.Series(5, index=['a','b','c','d'])
s4

a    5
b    5
c    5
d    5
dtype: int64

### Q.4. Access the second element from the Series s3

In [10]:
print('Using keys:',s3['b'])
print('Using index:',s3[1])

Using keys: 20
Using index: 20

C:\Users\ISHAN\AppData\Local\Temp\ipykernel_7984\1836220628.py:2: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  print('Using index:',s3[1])

## Vector operations on Series

In [14]:
s6 = s3+s4
print(s6)

a    15
b    25
c    35
d    45
dtype: int64

In [15]:
s5 = s1+s3
print(s5)

0   NaN
1   NaN
2   NaN
3   NaN
a   NaN
b   NaN
c   NaN
d   NaN
dtype: float64

In [23]:
s7 = pd.Series([100,200,300,400], index=['a','d','e','f'])
s7

a    100
d    200
e    300
f    400
dtype: int64

In [24]:
s8 = s4+s7
s8

a    105.0
b      NaN
c      NaN
d    205.0
e      NaN
f      NaN
dtype: float64

## Dataframes in Pandas

### Q.5. Create a dataframe to store students personal detail like: first name, last name, age and city. Store the details of at least 5 students.

In [26]:
df1 = pd.DataFrame({
    'fname': ['Alice','Bob','Charlie','Sam','Harry'],
    'lname': ['Potter','Williamson','Potter','Babbage','Potter'],
    'age': [19, 21, 22, 22, 23],
    'city': ['KNP','LKO','LKO','KNP','KNP']
})
df1

     fname       lname  age city
0    Alice      Potter   19  KNP
1      Bob  Williamson   21  LKO
2  Charlie      Potter   22  LKO
3      Sam     Babbage   22  KNP
4    Harry      Potter   23  KNP

### Q.6. Create a similar dataframe but using Series.

In [27]:
s1 = pd.Series(['Alice','Bob','Charlie','Sam','Harry'])
s2 = pd.Series(['Potter','Williamson','Potter','Babbage','Potter'])
s3 = pd.Series([19, 21, 22, 22, 23])
s4 = pd.Series(['KNP','LKO','LKO','KNP','KNP'])

df2 = pd.DataFrame({
    'fname': s1,
    'lname': s2,
    'age': s3,
    'city': s4
})
df2

     fname       lname  age city
0    Alice      Potter   19  KNP
1      Bob  Williamson   21  LKO
2  Charlie      Potter   22  LKO
3      Sam     Babbage   22  KNP
4    Harry      Potter   23  KNP

### Q.7. Print the age of all the students

In [30]:
df1['age']

0    19
1    21
2    22
3    22
4    23
Name: age, dtype: int64

### Q.8. Print last name and city for all the students

In [32]:
df1[['lname','city']]

        lname city
0      Potter  KNP
1  Williamson  LKO
2      Potter  LKO
3     Babbage  KNP
4      Potter  KNP

### Q.9. Find the details of students who lives in kanpur

In [35]:
df3 = df1[df1['city']=='KNP']
df3

   fname    lname  age city
0  Alice   Potter   19  KNP
3    Sam  Babbage   22  KNP
4  Harry   Potter   23  KNP

### Q.10. Find the details of students where age is greater than 20

In [36]:
df4 = df1[df1['age']>20]
df4

     fname       lname  age city
1      Bob  Williamson   21  LKO
2  Charlie      Potter   22  LKO
3      Sam     Babbage   22  KNP
4    Harry      Potter   23  KNP

### Q.11. Find the first name of the students where age is greater than 20 years.

In [38]:
df5 = df4['fname']
df5

1        Bob
2    Charlie
3        Sam
4      Harry
Name: fname, dtype: object

### Q.12. Find first name and Last name of students where age is greater than 20

In [46]:
df6 = df1[df1['age']>20][['fname','lname']]
df6

     fname       lname
1      Bob  Williamson
2  Charlie      Potter
3      Sam     Babbage
4    Harry      Potter

## Delete NaN values from a series

In [64]:
s9 = s5.dropna()
s9

Series([], dtype: float64)

In [65]:
s10 = s8.fillna(0)
s10

a    105.0
b      0.0
c      0.0
d    205.0
e      0.0
f      0.0
dtype: float64

### Q.13. Find the first name and age of students who lives in Lucknow using loc method

In [70]:
df7 = df1[df1['city']=='LKO'].loc[:,['fname','age']]
df7

     fname  age
1      Bob   21
2  Charlie   22

In [71]:
df8 = df1[df1['city']=='LKO'].iloc[:,[0,1]]
df8

     fname       lname
1      Bob  Williamson
2  Charlie      Potter

## Miscellaneous actions on dataframes

### Accessing the head of Dataframe

In [75]:
df1.head()

     fname       lname  age city
0    Alice      Potter   19  KNP
1      Bob  Williamson   21  LKO
2  Charlie      Potter   22  LKO
3      Sam     Babbage   22  KNP
4    Harry      Potter   23  KNP

In [76]:
df1.head(2)

   fname       lname  age city
0  Alice      Potter   19  KNP
1    Bob  Williamson   21  LKO

### Accessing the tail of Dataframe

In [78]:
df1.tail()

     fname       lname  age city
0    Alice      Potter   19  KNP
1      Bob  Williamson   21  LKO
2  Charlie      Potter   22  LKO
3      Sam     Babbage   22  KNP
4    Harry      Potter   23  KNP

### Get info about the Dataset

In [79]:
df1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   fname   5 non-null      object
 1   lname   5 non-null      object
 2   age     5 non-null      int64
 3   city    5 non-null      object
dtypes: int64(1), object(3)
memory usage: 292.0+ bytes